Revit 2027 API
AnalyticalPowerDistributableNodeData.GetApparentPerPhaseResults Method
 Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalPerPhaseData GetApparentPerPhaseResults()
Public Function GetApparentPerPhaseResults As ElectricalPerPhaseData
public:
ElectricalPerPhaseData^ GetApparentPerPhaseResults()
member GetApparentPerPhaseResults : unit -> ElectricalPerPhaseData
Return Value
ElectricalPerPhaseData
See Also
Reference
AnalyticalPowerDistributableNodeData Class
Autodesk.Revit.DB.Electrical Namespace